; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_4 ?v5 - type_2 ?v2 - type_3)
 	      (pred_2 ?v7 - object ?v2 - type_3)
	      (pred_3 ?v5 - type_2 ?v8 - type_1)
	      (pred_1 ?v5 - type_2 ?v7 - object ?v8 - type_1))

   (:action op_3
       :parameters  (?v5 - type_2 ?v1 ?v4 - type_3)
       :precondition (and  (pred_4 ?v5 ?v1))
       :effect (and  (pred_4 ?v5 ?v4)
		     (not (pred_4 ?v5 ?v1))))

   (:action op_1
       :parameters (?v5 - type_2 ?v3 - object ?v6 - type_3 ?v8 - type_1)
       :precondition  (and  (pred_2 ?v3 ?v6) (pred_4 ?v5 ?v6) (pred_3 ?v5 ?v8))
       :effect (and (pred_1 ?v5 ?v3 ?v8)
		    (not (pred_2 ?v3 ?v6)) 
		    (not (pred_3 ?v5 ?v8))))

   (:action op_2
       :parameters (?v5 - type_2 ?v3 - object ?v6 - type_3 ?v8 - type_1)
       :precondition  (and  (pred_1 ?v5 ?v3 ?v8) (pred_4 ?v5 ?v6))
       :effect (and (pred_2 ?v3 ?v6)
		    (pred_3 ?v5 ?v8)
		    (not (pred_1 ?v5 ?v3 ?v8)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_11 obj_04 - type_2
obj_06 obj_02 obj_09 obj_10 - type_1
obj_13 obj_12 obj_01 obj_05 - type_3
obj_14 obj_03 obj_08 obj_07 - object)
(:init
(pred_4 obj_11 obj_12)
(pred_3 obj_11 obj_06)
(pred_3 obj_11 obj_02)
(pred_4 obj_04 obj_01)
(pred_3 obj_04 obj_09)
(pred_3 obj_04 obj_10)
(pred_2 obj_14 obj_13)
(pred_2 obj_03 obj_01)
(pred_2 obj_08 obj_13)
(pred_2 obj_07 obj_05)
)
(:goal
(and
(pred_2 obj_14 obj_13)
(pred_2 obj_03 obj_12)
(pred_2 obj_08 obj_01)
(pred_2 obj_07 obj_01)
)
)

(:constraints
  (always (not (pred_4 obj_11 obj_01)))
)
)

; plan
1. (op_3 obj_11 obj_12 obj_13)
   deleted: (pred_4 obj_11 obj_12)
   added: (pred_4 obj_11 obj_13)
   goals met: 1 of 4
2. (op_1 obj_04 obj_03 obj_01 obj_10)
   deleted: (pred_2 obj_03 obj_01) (pred_3 obj_04 obj_10)
   added: (pred_1 obj_04 obj_03 obj_10)
   goals met: 1 of 4
3. (op_3 obj_04 obj_01 obj_12)
   deleted: (pred_4 obj_04 obj_01)
   added: (pred_4 obj_04 obj_12)
   goals met: 1 of 4
4. (op_1 obj_11 obj_08 obj_13 obj_02)
   deleted: (pred_2 obj_08 obj_13) (pred_3 obj_11 obj_02)
   added: (pred_1 obj_11 obj_08 obj_02)
   goals met: 1 of 4
5. (op_3 obj_11 obj_13 obj_05)
   deleted: (pred_4 obj_11 obj_13)
   added: (pred_4 obj_11 obj_05)
   goals met: 1 of 4
6. (op_2 obj_04 obj_03 obj_12 obj_10)
   deleted: (pred_1 obj_04 obj_03 obj_10)
   added: (pred_2 obj_03 obj_12) (pred_3 obj_04 obj_10)
   goals met: 2 of 4
7. (op_3 obj_04 obj_12 obj_05)
   deleted: (pred_4 obj_04 obj_12)
   added: (pred_4 obj_04 obj_05)
   goals met: 2 of 4
8. (op_2 obj_11 obj_08 obj_05 obj_02)
   deleted: (pred_1 obj_11 obj_08 obj_02)
   added: (pred_2 obj_08 obj_05) (pred_3 obj_11 obj_02)
   goals met: 2 of 4
9. (op_1 obj_04 obj_07 obj_05 obj_10)
   deleted: (pred_2 obj_07 obj_05) (pred_3 obj_04 obj_10)
   added: (pred_1 obj_04 obj_07 obj_10)
   goals met: 2 of 4
10. (op_3 obj_04 obj_05 obj_01)
   deleted: (pred_4 obj_04 obj_05)
   added: (pred_4 obj_04 obj_01)
   goals met: 2 of 4
11. (op_2 obj_04 obj_07 obj_01 obj_10)
   deleted: (pred_1 obj_04 obj_07 obj_10)
   added: (pred_2 obj_07 obj_01) (pred_3 obj_04 obj_10)
   goals met: 3 of 4
12. (op_3 obj_04 obj_01 obj_05)
   deleted: (pred_4 obj_04 obj_01)
   added: (pred_4 obj_04 obj_05)
   goals met: 3 of 4
13. (op_1 obj_04 obj_08 obj_05 obj_10)
   deleted: (pred_2 obj_08 obj_05) (pred_3 obj_04 obj_10)
   added: (pred_1 obj_04 obj_08 obj_10)
   goals met: 3 of 4
14. (op_3 obj_04 obj_05 obj_01)
   deleted: (pred_4 obj_04 obj_05)
   added: (pred_4 obj_04 obj_01)
   goals met: 3 of 4
15. (op_2 obj_04 obj_08 obj_01 obj_10)
   deleted: (pred_1 obj_04 obj_08 obj_10)
   added: (pred_2 obj_08 obj_01) (pred_3 obj_04 obj_10)
   goals met: 4 of 4
